console.log('script.js підключено')

const books = [//створює масив об'єктів books, де кожен об'єкт представляє книгу з властивостями title (назва книги), pages (кількість сторінок) та finished (логічне значення, яке вказує, чи книга прочитана)
  { title: "Маленький принц", pages: 76, finished: true },
  { title: "На західному фронті без змін", pages: 240, finished: true },
  { title: "1984", pages: 328, finished: false },
  { title: "Кобзар", pages: 210, finished: true },
  { title: "Гаррі Поттер і філософський камінь", pages: 320, finished: false },
  { title: "Тіні забутих предків", pages: 96, finished: false }
];

let sumOfPages = 0;//створює змінну sumOfPages і присвоює їй початкове значення 0
for (let i = 0; i < books.length; i++) {//цикл for, який проходить по всіх елементах масиву books
  console.log(`Книга: ${books[i].title}, сторінки: ${books[i].pages}, прочитано: ${books[i].finished}`);//виводить інформацію про кожну книгу в консоль
  if (books[i].finished === false) {//логічна перевірка, яка перевіряє, чи книга не прочитана (finished === false)
    sumOfPages += books[i].pages;//якщо книга не прочитана, додає кількість сторінок цієї книги до змінної sumOfPages
  }
  console.log(`Сума сторінок: ${sumOfPages}`);//виводить поточну суму сторінок, які ще потрібно прочитати, в консоль
}

const pagesPerDay = (pages, days) => Math.round(pages / days);//функція, яка приймає два параметри: pages (кількість сторінок) і days (кількість днів). Вона обчислює середню кількість сторінок на день, ділячи pages на days і округлюючи результат до найближчого цілого числа за допомогою Math.round().

console.log(`Середня кількість сторінок на день: ${pagesPerDay(sumOfPages, 30)}`);//виводить середню кількість сторінок на день, яку потрібно прочитати, щоб закінчити всі непрочитані книги за 30 днів. Використовує функцію pagesPerDay для обчислення цього значення.